#存放数据
Command_text=[

    """
关于指令:
    你可以使用指令来使用/设置软件内的一些功能
    使用/指令名 (参数(如果有))
    使用/help再次查看帮助
指令列表:
    /help --- 获取关于指令的帮助信息
    /updateLog --- 查看更新日志
    /run_pythoncode 代码 --- 使用自带的Python解释器运行输入的代码(高危操作,可能导致程序崩溃)
    /robot 名字 文本 --- 以虚拟用户的身份发送信息(会显示进服信息并分配一个假UUID)
    /data --- 特殊指令,用于传输数据,不会显示,客户端无法使用指令执行
    /op UUID --- 将UUID对应的设备设置为OP(该OP不能给其他用户设置OP)(仅服务器创建者可用)
    /ban UUID --- 让UUID对应的设备上的所有客户端崩溃(仅OP可用)(慎用)
""",
    """
V3.0.1.B1
    建立GIT仓库
V3.0.1.B2
    添加服务器功能
V3.0.1.B3
    添加进程关闭器
    添加快速输出数据至文本显示框
    修改服务器启动信息
V3.0.1.B4
    解决用户点击2次连接/创建服务器按钮的问题
    修改部分内容
V3.0.1.B5
    修复服务器线程不能及时结束的BUG
3.0.1.B6
    修复服务器线程不能及时结束的BUG
    添加服务器加入流程
    修复程序内存访问出错导致崩溃的恶性BUG
V3.0.1.B7
    修复程序无法正常退出的BUG
    修复套接字报错问题
V3.0.1.beta8
    修复一个可能会引起崩溃的BUG
V3.0.1.beta9
    修复程序在接收数据时会崩溃的问题
V3.0.1.beta10
    彻底修复了程序在接收数据时会崩溃的问题
    修复了一个"无法立即完成一个非阻止性套接字操作"问题
V3.0.1.beta11
    修复main.py中ui可能未定义的问题
V3.0.1.beta12
    代码莫名其妙的回滚了
    所有代码均已回滚至beta10
V3.0.1.beta13-14
    恢复代码
V3.0.1.beta15
    添加了指令
V3.0.1.beta16
    移除了一些非必要文件
V3.0.1.beta17
    修复"/run_pythoncode"指令中的一个错误
V3.0.1.beta18
    添加robot,data,op,ban指令
    添加进服提醒
V3.0.1.beta18-2
    为robot指令添加了假进服提醒并分配假UUID
V3.0.1.beta19
    修复了进服提醒的显示BUG
    修复op,ban指令的BUG
    添加了updateLog指令
    使用datas.py存放数据
    添加了文件传输函数(功能未实现)
    可执行文件编译环境改为 win7x64英文版 虚拟机
V3.0.1.beta20
    修复了指令在执行时不会检查用户权限的问题
    修改了服务器在遇到转发失败时的逻辑(改为直接关闭该套接字)
V3.0.1-正式版
    修复了服务器线程在错误处理中的一个缩进错误
    修复了导致客户端崩溃的致命BUG
"""

]